---
kind: property
id: P:Autodesk.Revit.DB.Visual.AdvancedWood.WoodDiffusePerlinEnable
source: html/11a1be9e-d498-6ba9-deeb-df5f2c0c8ef0.htm
---
# Autodesk.Revit.DB.Visual.AdvancedWood.WoodDiffusePerlinEnable Property

The property labeled "Use perlin function for diffuse albedo" from the "AdvancedWood" schema.

## Syntax (C#)
```csharp
public static string WoodDiffusePerlinEnable { get; }
```

## Remarks
This property is of type "AssetPropertyBoolean".